# Pandas

## Series

In [139]:
import numpy as np
import pandas as pd

In [140]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [141]:
obj.array

<PandasArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [142]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [143]:
obj2 = pd.Series([4, 7, 5, 3], index = ["d", "b", "a", "c"])
obj2

d    4
b    7
a    5
c    3
dtype: int64

In [144]:
sdata = {
    "Ohio": 35000,
    "Texas": 71000,
    "Oregon": 16000,
    "Utah": 5000
}

obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [145]:
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [146]:
states = ["California", "Ohio", "Oregon", "Texas"]
obj4 = pd.Series(sdata, index = states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [147]:
pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [148]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [149]:
obj4.name = "population"
obj4.index.name = "state"
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [150]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [151]:
obj.index = ["Bob", "Steve", "Jeff", "Ryan"]
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

## DataFrames

In [152]:
data = {
    "state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
    "year": [2000, 2001, 2002, 2001, 2002, 2003],
    "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [153]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [154]:
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [155]:
frame2 = pd.DataFrame(data, columns = ["year", "state", "pop", "debt"])
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [156]:
frame2.columns
frame2.index = [6, 7, 8, 9, 10, 11]

In [157]:
frame2.iloc[1:5].loc[6:9, "year"]

7    2001
8    2002
9    2001
Name: year, dtype: int64

In [158]:
frame2bis = pd.DataFrame(data, columns = ["year", "state", "pop", "debt"])
frame2bis

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [159]:
frame2bis["debt"] = 16.5
frame2bis["debt"] = np.arange(6.)
frame2bis

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [160]:
val = pd.Series([-1.2, -1.5, -1.7, -2], index = ["two", "four", "five", 0])
frame2bis["add"] = val # Only present indices are added
frame2bis

   year   state  pop  debt  add
0  2000    Ohio  1.5   0.0 -2.0
1  2001    Ohio  1.7   1.0  NaN
2  2002    Ohio  3.6   2.0  NaN
3  2001  Nevada  2.4   3.0  NaN
4  2002  Nevada  2.9   4.0  NaN
5  2003  Nevada  3.2   5.0  NaN

In [161]:
frame2bis["eastern"] = frame2bis["state"] == "Ohio"
frame2bis

   year   state  pop  debt  add  eastern
0  2000    Ohio  1.5   0.0 -2.0     True
1  2001    Ohio  1.7   1.0  NaN     True
2  2002    Ohio  3.6   2.0  NaN     True
3  2001  Nevada  2.4   3.0  NaN    False
4  2002  Nevada  2.9   4.0  NaN    False
5  2003  Nevada  3.2   5.0  NaN    False

In [162]:
del frame2bis["eastern"]
frame2bis.columns

Index(['year', 'state', 'pop', 'debt', 'add'], dtype='object')

In [163]:
populations = {
    "Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
    "Nevada": {2001: 2.4, 2002: 2.9},
    "Arizona": {2000: "Heavy Boi", 2002: "Was ok"}
}
frame3 = pd.DataFrame(populations)
frame3

      Ohio  Nevada    Arizona
2000   1.5     NaN  Heavy Boi
2001   1.7     2.4        NaN
2002   3.6     2.9     Was ok

In [164]:
frame3.T # This discards the data type

              2000 2001    2002
Ohio           1.5  1.7     3.6
Nevada         NaN  2.4     2.9
Arizona  Heavy Boi  NaN  Was ok

In [165]:
pdata = {
    "Ohio": frame3["Ohio"][:-1],
    "Nevada": frame3["Nevada"][:2]
}
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [166]:
arr = np.arange(5, 17).reshape(3, 4)
arr

array([[ 5,  6,  7,  8],
       [ 9, 10, 11, 12],
       [13, 14, 15, 16]])

In [167]:
pd.DataFrame(arr)

    0   1   2   3
0   5   6   7   8
1   9  10  11  12
2  13  14  15  16

In [168]:
lst = [{k: i ** k for k in range(1, 6)} for i in range(6)]
lst

[{1: 0, 2: 0, 3: 0, 4: 0, 5: 0},
 {1: 1, 2: 1, 3: 1, 4: 1, 5: 1},
 {1: 2, 2: 4, 3: 8, 4: 16, 5: 32},
 {1: 3, 2: 9, 3: 27, 4: 81, 5: 243},
 {1: 4, 2: 16, 3: 64, 4: 256, 5: 1024},
 {1: 5, 2: 25, 3: 125, 4: 625, 5: 3125}]

In [169]:
pd.DataFrame(lst)

   1   2    3    4     5
0  0   0    0    0     0
1  1   1    1    1     1
2  2   4    8   16    32
3  3   9   27   81   243
4  4  16   64  256  1024
5  5  25  125  625  3125

In [170]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index = ["d", "b", "a", "c"])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [171]:
obj2 = obj.reindex(["a", "b", "c", "d", "e"])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [172]:
obj3 = pd.Series(["blue", "purple", "yellow"], index = [0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [173]:
obj3.reindex(pd.RangeIndex(6), method = "ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [174]:
frame = pd.DataFrame(np.arange(9).reshape(3, 3), index = ["a", "c", "d"], columns = ["Ohio", "Texas", "California"])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [175]:
frame2 = frame.reindex(["a", "b", "c", "d"])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [176]:
states = ["Texas", "Utah", "California"]
frame2.reindex(columns=states)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [177]:
frame2.reindex(states, axis="columns")

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [178]:
def alphabetic_list(start, end, step):
    alphabet = "abcdefghijklmnopqrstuvwxyz"
    return list(alphabet[start:end:step])

In [179]:
obj = pd.Series(np.arange(5.), index=alphabetic_list(0, 5, 1))
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [180]:
new_obj = obj.drop("c")
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [181]:
obj.drop(["c", "d"])

a    0.0
b    1.0
e    4.0
dtype: float64

In [182]:
data = pd.DataFrame(np.arange(16).reshape(4, 4), index = ["Ohio", "Colorado", "Uath", "New York"], columns = ["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Uath        8    9     10    11
New York   12   13     14    15

In [183]:
data.drop("one", axis = "columns")

          two  three  four
Ohio        1      2     3
Colorado    5      6     7
Uath        9     10    11
New York   13     14    15

In [184]:
obj1 = pd.Series([1, 2, 3], index=[2, 0 ,1])
obj1

2    1
0    2
1    3
dtype: int64

In [185]:
obj1[2]

1

In [186]:
obj1[[0, 1, 2]] # This is secretly a .loc

0    2
1    3
2    1
dtype: int64

In [187]:
obj2 = pd.Series([1, 2, 3], index=alphabetic_list(0, 3, 1))
obj2

a    1
b    2
c    3
dtype: int64

In [188]:
obj2[2]

3

In [189]:
obj2[[0, 1, 2]] # The treatment differs depending on whether the index is integer based or not. This is secretly a .iloc

a    1
b    2
c    3
dtype: int64

In [190]:
obj1[[0, 1, 2]]

0    2
1    3
2    1
dtype: int64

In [191]:
obj1.loc[[0, 1, 2]]

0    2
1    3
2    1
dtype: int64

In [192]:
obj1.iloc[[0, 1, 2]]

2    1
0    2
1    3
dtype: int64

In [193]:
obj1.loc[2:1] # loc is inclusive

2    1
0    2
1    3
dtype: int64

In [194]:
obj1.iloc[0:2] # iloc is exclusive

2    1
0    2
dtype: int64

In [195]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [196]:
ser.iloc[-1]

2.0

In [197]:
df = pd.DataFrame(np.arange(12).reshape(4,3))
df

   0   1   2
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [198]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)), columns=list("abcd"))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [199]:
df2 = pd.DataFrame(np.arange(20.).reshape((4,5)), columns=list("abcde"))
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [200]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [201]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [202]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [203]:
arr[0]

array([0., 1., 2., 3.])

In [204]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [205]:
rng = np.random.default_rng(12345)
input_array = rng.standard_normal(size=(3,3))
input_array = np.arange(9.).reshape(3,3)
frame = pd.DataFrame(input_array, columns = list("bde"), index = ["Utah", "Ohio", "Texas"])
frame

         b    d    e
Utah   0.0  1.0  2.0
Ohio   3.0  4.0  5.0
Texas  6.0  7.0  8.0

In [206]:
series = frame.iloc[:, 0]
series

Utah     0.0
Ohio     3.0
Texas    6.0
Name: b, dtype: float64

In [207]:
frame.sub(series, axis = "index")

         b    d    e
Utah   0.0  1.0  2.0
Ohio   0.0  1.0  2.0
Texas  0.0  1.0  2.0

In [208]:
frame = pd.DataFrame(np.random.standard_normal((4, 3)), columns=list("bde"), index = ["Utah", "Ohio", "Texas", "Oregon"])
frame

               b         d         e
Utah   -0.323607 -0.182446 -0.483968
Ohio   -0.089653 -0.083440 -0.688791
Texas  -0.422590  0.208018 -0.166459
Oregon  0.894952 -2.147570  0.701269

In [209]:
np.abs(frame)

               b         d         e
Utah    0.323607  0.182446  0.483968
Ohio    0.089653  0.083440  0.688791
Texas   0.422590  0.208018  0.166459
Oregon  0.894952  2.147570  0.701269

In [210]:
def f1(x):
    return x.max() - x.min()

frame.apply(f1, axis="columns")

Utah      0.301522
Ohio      0.605351
Texas     0.630608
Oregon    3.042522
dtype: float64

In [211]:
def f2(x):
    return pd.Series([x.min(), x.max()], index=["min", "max"])

frame.apply(f2, axis="columns")

             min       max
Utah   -0.483968 -0.182446
Ohio   -0.688791 -0.083440
Texas  -0.422590  0.208018
Oregon -2.147570  0.894952

In [212]:
def my_format(x):
    return f"{x:.2f}"

frame.applymap(my_format)

            b      d      e
Utah    -0.32  -0.18  -0.48
Ohio    -0.09  -0.08  -0.69
Texas   -0.42   0.21  -0.17
Oregon   0.89  -2.15   0.70

In [213]:
obj = pd.Series(np.arange(4), index = list("dabc"))
obj

d    0
a    1
b    2
c    3
dtype: int32

In [214]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int32

In [215]:
frame.sort_values(["b", "d"], ascending=[False, False])

               b         d         e
Oregon  0.894952 -2.147570  0.701269
Ohio   -0.089653 -0.083440 -0.688791
Utah   -0.323607 -0.182446 -0.483968
Texas  -0.422590  0.208018 -0.166459

In [216]:
df = pd.DataFrame([[1, 1, 2, 3], [1, 2, 2, 3], [2, 3, 6, 1], [4, 1, 7, 8]], columns=list("abcd"))
df

   a  b  c  d
0  1  1  2  3
1  1  2  2  3
2  2  3  6  1
3  4  1  7  8

In [217]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [218]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [219]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]], index = list("abcd"), columns = ["one", "two"])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [220]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [221]:
df.sum(axis = "columns")

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [222]:
df.sum(skipna=False)

one   NaN
two   NaN
dtype: float64

In [223]:
df.sum(axis="columns", skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [224]:
df.mean(axis="columns")

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [225]:
obj = pd.DataFrame({"numbers": {0: 15, 1: 16, 2:23}, "strings": {0: "Hi", 1: "Itsame", 2: "Mario"}})
obj

   numbers strings
0       15      Hi
1       16  Itsame
2       23   Mario

In [226]:
obj.loc[:,["strings"]].describe()

       strings
count        3
unique       3
top         Hi
freq         1

In [227]:
price = pd.read_pickle("examples/yahoo_price.pkl")
volume = pd.read_pickle("examples/yahoo_volume.pkl")

In [228]:
price.head()

                 AAPL        GOOG         IBM       MSFT
Date
2010-01-04  27.990226  313.062468  113.304536  25.884104
2010-01-05  28.038618  311.683844  111.935822  25.892466
2010-01-06  27.592626  303.826685  111.208683  25.733566
2010-01-07  27.541619  296.753749  110.823732  25.465944
2010-01-08  27.724725  300.709808  111.935822  25.641571

In [229]:
volume.head()

                 AAPL      GOOG      IBM      MSFT
Date
2010-01-04  123432400   3927000  6155300  38409100
2010-01-05  150476200   6031900  6841400  49749600
2010-01-06  138040000   7987100  5605300  58182400
2010-01-07  119282800  12876600  5840600  50559700
2010-01-08  111902700   9483900  4197200  51197400

In [230]:
returns = price.pct_change(periods=1)
returns.head()

                AAPL      GOOG       IBM      MSFT
Date
2010-01-04       NaN       NaN       NaN       NaN
2010-01-05  0.001729 -0.004404 -0.012080  0.000323
2010-01-06 -0.015906 -0.025209 -0.006496 -0.006137
2010-01-07 -0.001849 -0.023280 -0.003462 -0.010400
2010-01-08  0.006648  0.013331  0.010035  0.006897

In [231]:
returns["MSFT"].corr(returns["IBM"])

0.4997636114415114

In [232]:
returns["MSFT"].cov(returns["IBM"])

8.870655479703546e-05

In [233]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [234]:
rng = np.random.default_rng(12345)
corr_df = pd.DataFrame(rng.standard_normal(size = (1000000, 2)), columns = ["Var1", "Var2"])
corr_df.corr()

          Var1      Var2
Var1  1.000000 -0.000565
Var2 -0.000565  1.000000

In [235]:
returns

                AAPL      GOOG       IBM      MSFT
Date
2010-01-04       NaN       NaN       NaN       NaN
2010-01-05  0.001729 -0.004404 -0.012080  0.000323
2010-01-06 -0.015906 -0.025209 -0.006496 -0.006137
2010-01-07 -0.001849 -0.023280 -0.003462 -0.010400
2010-01-08  0.006648  0.013331  0.010035  0.006897
...              ...       ...       ...       ...
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

[1714 rows x 4 columns]

In [236]:
returns.corrwith(volume)

AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64

In [237]:
obj = pd.Series(list("cadaabbcc"))
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [238]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [239]:
obj = pd.DataFrame({"Letter": list("cadaabbcc"), "Number": list("123456789")})
obj

  Letter Number
0      c      1
1      a      2
2      d      3
3      a      4
4      a      5
5      b      6
6      b      7
7      c      8
8      c      9

In [240]:
obj.value_counts()

Letter  Number
a       2         1
        4         1
        5         1
b       6         1
        7         1
c       1         1
        8         1
        9         1
d       3         1
dtype: int64

In [241]:
obj.isin(list("bc"))

   Letter  Number
0    True   False
1   False   False
2   False   False
3   False   False
4   False   False
5    True   False
6    True   False
7    True   False
8    True   False

In [242]:
obj[obj["Letter"].isin(list("bc"))]

  Letter Number
0      c      1
5      b      6
6      b      7
7      c      8
8      c      9

In [243]:
data = pd.DataFrame({"Qu1": [1, 3, 4, 3, 4], "Qu2": [2, 3, 1, 2, 3], "Qu3": [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [244]:
data["Qu1"].value_counts().sort_index()

1    1
3    2
4    2
Name: Qu1, dtype: int64

In [245]:
!type examples/ex1.csv

The syntax of the command is incorrect.

In [246]:
df = pd.read_csv("examples/ex1.csv")
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [250]:
df2 = pd.read_csv("examples/ex2.csv", header=None, names=["col1", "col2", "col3", "col4", "message"])
df2

   col1  col2  col3  col4 message
0     1     2     3     4   hello
1     5     6     7     8   world
2     9    10    11    12     foo

In [255]:
pd.options.display.max_rows = 10

result = pd.read_csv("examples/ex6.csv")
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [257]:
result_mini = pd.read_csv("examples/ex6.csv", nrows = 3)
result_mini

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G

In [259]:
chunker = pd.read_csv("examples/ex6.csv", chunksize=1000)
type(chunker)

pandas.io.parsers.readers.TextFileReader

In [260]:
for i, piece in enumerate(chunker):
    piece.to_csv("Test" + str(i) + ".csv")

In [261]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [270]:
data = pd.DataFrame([[1, 6.5, 3.], [1., np.nan, np.nan], [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [273]:
data.dropna(axis="rows")

     0    1    2
0  1.0  6.5  3.0

In [274]:
df = pd.DataFrame(np.random.standard_normal((7,3)))
df.iloc[:4, 1] = np.nan
df.iloc[:2, 2] = np.nan
df

          0         1         2
0 -0.402322       NaN       NaN
1 -0.673327       NaN       NaN
2  0.954658       NaN  0.906893
3  0.657917       NaN  0.604304
4 -0.906589  1.920281  1.418135
5 -1.081370  0.054335  0.032631
6  1.205231 -1.032524 -0.577258

In [277]:
df.fillna(0)

          0         1         2
0 -0.402322  0.000000  0.000000
1 -0.673327  0.000000  0.000000
2  0.954658  0.000000  0.906893
3  0.657917  0.000000  0.604304
4 -0.906589  1.920281  1.418135
5 -1.081370  0.054335  0.032631
6  1.205231 -1.032524 -0.577258

In [278]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.402322  0.500000  0.000000
1 -0.673327  0.500000  0.000000
2  0.954658  0.500000  0.906893
3  0.657917  0.500000  0.604304
4 -0.906589  1.920281  1.418135
5 -1.081370  0.054335  0.032631
6  1.205231 -1.032524 -0.577258

In [282]:
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"], "k2": [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [283]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [284]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [285]:
data["v1"] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [288]:
data.drop_duplicates(subset = ["k1"], keep = "first")

    k1  k2  v1
0  one   1   0
1  two   1   1

In [290]:
data = pd.DataFrame({
    "food": ["bacon", "pulled pork", "bacon", "pastrami", "corned beef", "bacon", "pastrami", "honey ham", "nova lox"],
    "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]}
)
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [301]:
meat_to_animal = {
    "bacon": "pig",
    "pulled pork": "pig",
    "pastrami": "cow",
    "corned beef": "cow",
    "nova lox": "salmon"
}
data["animal"] = data["food"].map(meat_to_animal)
data

          food  ounces  animal animal_via_lambda
0        bacon     4.0     pig               pig
1  pulled pork     3.0     pig               pig
2        bacon    12.0     pig               pig
3     pastrami     6.0     cow               cow
4  corned beef     7.5     cow               cow
5        bacon     8.0     pig               pig
6     pastrami     3.0     cow               cow
7    honey ham     5.0     NaN         Not Found
8     nova lox     6.0  salmon            salmon

In [302]:
data["animal_via_lambda"] = data["food"].map(lambda x: meat_to_animal.get(x, "Not Found"))
data

          food  ounces  animal animal_via_lambda
0        bacon     4.0     pig               pig
1  pulled pork     3.0     pig               pig
2        bacon    12.0     pig               pig
3     pastrami     6.0     cow               cow
4  corned beef     7.5     cow               cow
5        bacon     8.0     pig               pig
6     pastrami     3.0     cow               cow
7    honey ham     5.0     NaN         Not Found
8     nova lox     6.0  salmon            salmon

In [303]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)), index=["Ohio", "Colorado", "New York"], columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [305]:
def transform(x):
    return x[:5].upper()

In [306]:
data.index = data.index.map(transform)
data

       one  two  three  four
OHIO     0    1      2     3
COLOR    4    5      6     7
NEW Y    8    9     10    11

In [310]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
age_categories = pd.cut(ages, bins)
age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [308]:
age_categories.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [314]:
ages = [17, 20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
age_categories = pd.cut(ages, bins, right=False, labels = ["Youth", "YoungAdult", "MiddleAged", "Senior"])
age_categories

[NaN, 'Youth', 'Youth', 'YoungAdult', 'YoungAdult', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 13
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [315]:
pd.value_counts(age_categories)

Youth         4
YoungAdult    4
MiddleAged    3
Senior        1
dtype: int64

In [318]:
data = np.random.uniform(size = 20)
data_categories = pd.cut(data, 4, precision = 2)
data_categories

[(0.73, 0.97], (0.73, 0.97], (0.0087, 0.25], (0.0087, 0.25], (0.25, 0.49], ..., (0.0087, 0.25], (0.73, 0.97], (0.25, 0.49], (0.0087, 0.25], (0.73, 0.97]]
Length: 20
Categories (4, interval[float64, right]): [(0.0087, 0.25] < (0.25, 0.49] < (0.49, 0.73] < (0.73, 0.97]]

In [319]:
pd.value_counts(data_categories)

(0.73, 0.97]      7
(0.49, 0.73]      5
(0.0087, 0.25]    4
(0.25, 0.49]      4
dtype: int64

In [321]:
# Using quantiles instead

data = np.random.standard_normal(1000)
quartiles = pd.qcut(data, 4, precision = 2)
quartiles

[(0.63, 2.85], (-0.6, -0.0065], (-0.6, -0.0065], (0.63, 2.85], (-2.9299999999999997, -0.6], ..., (-0.6, -0.0065], (-2.9299999999999997, -0.6], (-2.9299999999999997, -0.6], (-2.9299999999999997, -0.6], (0.63, 2.85]]
Length: 1000
Categories (4, interval[float64, right]): [(-2.9299999999999997, -0.6] < (-0.6, -0.0065] < (-0.0065, 0.63] < (0.63, 2.85]]

In [322]:
pd.value_counts(quartiles)

(-2.9299999999999997, -0.6]    250
(-0.6, -0.0065]                250
(-0.0065, 0.63]                250
(0.63, 2.85]                   250
dtype: int64

In [340]:
data = np.random.standard_normal(1000)
quartiles = pd.qcut(data, [0, 0.3, 0.8, 0.9, 1.], precision = 2)
quartiles

[(-0.56, 0.73], (-0.56, 0.73], (0.73, 1.12], (-0.56, 0.73], (-3.44, -0.56], ..., (0.73, 1.12], (1.12, 3.17], (-0.56, 0.73], (-0.56, 0.73], (-3.44, -0.56]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.44, -0.56] < (-0.56, 0.73] < (0.73, 1.12] < (1.12, 3.17]]

In [343]:
pd.value_counts(quartiles).sort_index()

(-3.44, -0.56]    300
(-0.56, 0.73]     500
(0.73, 1.12]      100
(1.12, 3.17]      100
dtype: int64

In [361]:
import re

regex = re.compile(r'h[^\s]*', flags = re.IGNORECASE)
result = regex.match('hello world')

if result:
    print("Yes")
result[0]

Yes

'hello'

In [379]:
df = pd.DataFrame([["Hello", "Howdy", "Hola"], ["Friend", "Pardner", "Amigo"]])
df

        0        1      2
0   Hello    Howdy   Hola
1  Friend  Pardner  Amigo

In [389]:
df.apply(" ".join, axis = "rows")

0     Hello Friend
1    Howdy Pardner
2       Hola Amigo
dtype: object

In [391]:
data = pd.Series(np.random.uniform(size=9), index = [list("aaabbccdd"), [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1    0.805942
   2    0.228177
   3    0.972861
b  1    0.968439
   3    0.339931
c  1    0.203656
   2    0.518099
d  2    0.431626
   3    0.200596
dtype: float64

In [392]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [393]:
data.loc[:, 2]

a    0.228177
c    0.518099
d    0.431626
dtype: float64

In [397]:
data.unstack()

          1         2         3
a  0.805942  0.228177  0.972861
b  0.968439       NaN  0.339931
c  0.203656  0.518099       NaN
d       NaN  0.431626  0.200596

In [400]:
data.unstack().stack()

a  1    0.805942
   2    0.228177
   3    0.972861
b  1    0.968439
   3    0.339931
c  1    0.203656
   2    0.518099
d  2    0.431626
   3    0.200596
dtype: float64

In [401]:
frame = pd.DataFrame(
    np.arange(12).reshape(4,3),
    index=[list("aabb"), [1, 2, 1, 2]],
    columns=[["Ohio", "Ohio", "Colorado"], ["Green", "Red", "Green"]]
)
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [403]:
frame.index.names = ["key1", "key2"]
frame.columns.names = ["state", "colour"]
frame

state      Ohio     Colorado
colour    Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [404]:
frame.index.nlevels

2

In [444]:
frame.loc[(slice(None), 1), "Ohio"]

colour     Green  Red
key1 key2
a    1         0    1
b    1         6    7

In [425]:
frame2 = pd.DataFrame(np.arange(6).reshape(2, 3), index = [1, 2], columns = ["a", "b", "c"])
frame2

   a  b  c
1  0  1  2
2  3  4  5

In [445]:
frame2.loc[slice(None), "c"]

1    2
2    5
Name: c, dtype: int32

In [446]:
idx = pd.IndexSlice

frame.loc[idx[:, 1], "Ohio"]

colour     Green  Red
key1 key2
a    1         0    1
b    1         6    7

In [447]:
frame.index

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           names=['key1', 'key2'])